*Exercise 1.3:* Define a procedure that takes three numbers as
arguments and returns the sum of the squares of the two larger
numbers.

#+begin_src scheme :results list
  (define (square n)
    (* n n)
    )

  (define (sum-of-squares x y)
    (+ (square x) (square y))
    )

  (define (remove-min l)
    (remove (apply min l) l)
    )


  (define (arbitrary-procedure a b c)
    (apply sum-of-squares (remove-min (list a b c)))
    )

  (list
   (arbitrary-procedure 9 3 1)
   (arbitrary-procedure 8 32 4)
   (arbitrary-procedure 100 100 101)
   )
#+end_src

#+RESULTS:
- 90
- 1088
- 20201
